app/controllers/short_urls_controller.rb

SELECT `short_urls`.* FROM `short_urls` ORDER BY `short_urls`.`click_count` DESC LIMIT 100
---
  def index
    @short_urls = ShortUrl.order(click_count: :desc).limit(100)

SELECT `short_urls`.* FROM `short_urls` ORDER BY `short_urls`.`id` ASC LIMIT 1
UPDATE `short_urls` SET `short_urls`.`click_count` = 1, `short_urls`.`updated_at` = '2022-05-03 10:01:38.224220' WHERE `short_urls`.`id` = 1114
---
  def show
    @short_urls = ShortUrl.first
    @short_urls.update_attribute(:click_count, @short_urls.click_count + 1)

INSERT INTO `short_urls` (`full_url`, `created_at`, `updated_at`) VALUES ('https://www.test.rspec', '2022-05-03 09:54:48.317804', '2022-05-03 09:54:48.317804')
---
  def create
    @short_urls = ShortUrl.new(full_url: params[:full_url])

    respond_to do |format|
      if @short_urls.save